УТ/src/Catalogs/CRM_УчетныеЗаписиВнешнихКалендарей/CRM_УчетныеЗаписиВнешнихКалендарей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиВнешнихКалендарей</name>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.CRM_СервисыКалендарей</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогКалендарей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_УчетныеЗаписиВнешнихКалендарей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Код = "" Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	CRM_УчетныеЗаписиВнешнихКалендарей.Код КАК Код,
		|	CRM_УчетныеЗаписиВнешнихКалендарей.Наименование КАК Наименование,
		|	CRM_УчетныеЗаписиВнешнихКалендарей.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.CRM_УчетныеЗаписиВнешнихКалендарей КАК CRM_УчетныеЗаписиВнешнихКалендарей
		|ГДЕ
		|	CRM_УчетныеЗаписиВнешнихКалендарей.Наименование = &Наименование
		|	И CRM_УчетныеЗаписиВнешнихКалендарей.Сервис = &Сервис
		|	И CRM_УчетныеЗаписиВнешнихКалендарей.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Сервис", Сервис);
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		РезультатВыполнения = Запрос.Выполнить();

		Если Не РезультатВыполнения.Пустой() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.CRM_НастройкиСинхронизацииСВнешнимиКалендарями.УдалитьНастройкиПоУчетнойЗаписиВнешнегоКалендаря(
		Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
